app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "unJ0TAe48Ye-5w05FL-wnA"], ["LIMIT", 1]]
---
    def generate_unique_session_token
        self.session_token = SecureRandom.urlsafe_base64
        while (User.find_by(session_token: self.session_token))